app/views/layouts/shared/admin/_content.html.erb

SELECT SUM("orders"."revenue") FROM "orders" WHERE "orders"."created_at" BETWEEN $1 AND $2  [["created_at", "2024-01-01 00:00:00"], ["created_at", "2024-12-31 23:59:59.999999"]]
---
                                Earnings (Annual)</div>
                            <div class="h5 mb-0 font-weight-bold text-gray-800"><%= number_to_currency(Order.where(created_at: Time.current.beginning_of_year..Time.current.end_of_year).sum(:revenue), unit: '$', separator: ',', delimiter: '.') %></div>