app/views/admin/home/charts.html.erb

                                        <%# here %>
                                        <%= line_chart Product.group_by_day(:created_at).count %>
---
SELECT COUNT(*) AS "count_all", DATE_TRUNC('day', "products"."created_at"::timestamptz AT TIME ZONE 'Etc/UTC')::date AS "date_trunc_day_products_created_at_timestamptz_at_time_zone_etc" FROM "products" WHERE ("products"."created_at" IS NOT NULL) GROUP BY DATE_TRUNC('day', "products"."created_at"::timestamptz AT TIME ZONE 'Etc/UTC')::date