app/controllers/carts_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", "f3741252-f00c-490e-a79c-ff1b3ec59790"], ["LIMIT", 1]]
INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", "f3741252-f00c-490e-a79c-ff1b3ec59790"], ["created_at", "2024-11-23 15:30:28.142517"], ["updated_at", "2024-11-23 15:30:28.142517"]]
---
    def new
        # if the user have one cart
        if current_user.cart.present?
            redirect_to cart_path(current_user.cart)
        else
            # make a new cart
            @cart = current_user.build_cart

            # if make correcly the cart
            if @cart.save

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", "e965a837-79aa-4064-92dd-8cfe39d19976"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", "f3741252-f00c-490e-a79c-ff1b3ec59790"], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", "f3741252-f00c-490e-a79c-ff1b3ec59790"], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1 AND "cart_items"."product_id" = $2 LIMIT $3  [["cart_id", "b7450d5a-6130-4740-9a0e-aea0590efdac"], ["product_id", "863bf642-cb19-4d75-9d04-796558be894b"], ["LIMIT", 1]]
---
    def add_to_cart

        @product = Product.find_by(id: params[:product_id])
        if current_user.id == @product.user_id
            flash[:error] = "You can not buy your own product"
            redirect_to root_path
            return
        end

        if @product
            @cart = current_user.cart || current_user.build_cart
            cart_item = @cart.cart_items.find_or_initialize_by( product: @product )

SELECT "products".* FROM "products" WHERE "products"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1  [["cart_id", "b7450d5a-6130-4740-9a0e-aea0590efdac"]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", "f3741252-f00c-490e-a79c-ff1b3ec59790"], ["LIMIT", 1]]
SELECT 1 AS one FROM "cart_items" WHERE "cart_items"."cart_id" = $1 LIMIT $2  [["cart_id", "b7450d5a-6130-4740-9a0e-aea0590efdac"], ["LIMIT", 1]]
---
    def show
        @cart = current_user.cart || current_user.build_cart
        @product = Product.find_by(id: params[:product_id])
        @cart_items = @cart.cart_items

        if @cart.cart_items.empty?

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", "f3741252-f00c-490e-a79c-ff1b3ec59790"], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1  [["cart_id", "b7450d5a-6130-4740-9a0e-aea0590efdac"]]
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", "863bf642-cb19-4d75-9d04-796558be894b"], ["LIMIT", 1]]
SELECT "wallets".* FROM "wallets" WHERE "wallets"."user_id" = $1 LIMIT $2  [["user_id", "f3741252-f00c-490e-a79c-ff1b3ec59790"], ["LIMIT", 1]]
---
    def checkout
        @cart = current_user.cart
        @order = @current_user.orders.build

        total_revenue = 0

        @cart.cart_items.each do |cart_item|
            @order.order_items.build(
                product: cart_item.product,
                quantity: cart_item.quantity,
                price: cart_item.price * cart_item.quantity
            )

            total_revenue += cart_item.price * cart_item.quantity
        end

        if current_user.wallet.present? && current_user.wallet.balance >= total_revenue

INSERT INTO "activity_logs" ("user_id", "trackable_type", "trackable_id", "action", "details", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create_activity_log(action, trackable, details: {})
        ActivityLog.create!(user: current_user, action: action, trackable: trackable, details: details)