app/controllers/home_controller.rb

SELECT "products".* FROM "products"
---
    def about

        # Test for show the current_user.product 1st of others
        # @products = @products.sort_by { |product| product.user == current_user ? 0 : 1 }

        @products = Product.all