app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", "3127244d-eb26-4a10-85e9-00b9bb47cb1c"], ["LIMIT", 1]]
---
    def favorite
        @product = Product.find(params[:id])

INSERT INTO "products" ("name", "quantity", "price", "description", "category", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create

        @product = current_user.products.build(product_params)
        @product.image.attach(params[:product][:image]) if params[:product][:image]

        if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", "e965a837-79aa-4064-92dd-8cfe39d19976"], ["LIMIT", 1]]
UPDATE "products" SET "updated_at" = $1 WHERE "products"."id" = $2  [["updated_at", "2024-11-23 13:09:01.738372"], ["id", "e965a837-79aa-4064-92dd-8cfe39d19976"]]
---
    def update
        @product = Product.find(params[:id])
        if @product.update(product_params)

INSERT INTO "activity_logs" ("user_id", "trackable_type", "trackable_id", "action", "details", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create_activity_log(action, trackable, details: {} )
        ActivityLog.create!(user: current_user, action: action, trackable: trackable, details: details)