app/controllers/users_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def admin_user

    email = SecureRandom.hex(5) + "@example.com"
    password = Devise.friendly_token[0, 20]

    user = User.new(email: email, password: password, role: 1)

    if user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", "f3741252-f00c-490e-a79c-ff1b3ec59790"], ["LIMIT", 1]]
---
  def add_balance
    @user = User.find(params[:id])